"""
Напишите программу принимающую ввод информации о треке
(место в чарте,исполнитель, название) пока пользователь
не введет "off". Программа должна вывести всю информацию
в виде словаря вида: {(место,испонитель): название трека}
"""
songs = dict()
place = input('Введите место')
singer = input('Введите исполнителя')
music = input('Введите название трека')
while place != 'off' and singer != 'off' and music != 'off':
    songs [(place, singer)] = music
    place = input('Введите место')
    singer = input('Введите исполнителя')
    music = input('Введите название трека')
print(songs)